-- ------------------------------------------------------------------------------
-- 此指令碼用於將 Pandas 的主資料庫升級到 2022.10.06 版本
-- 注意: 若存在更低版本且從未匯入的升級指令碼, 請按版本號從小到大依序匯入
-- ------------------------------------------------------------------------------

-- -----------------------------------------------
-- upgrade_20220818.sql
-- -----------------------------------------------

UPDATE `mail`
SET `send_id`='0'
WHERE `send_id` NOT IN (
	select `char_id`
	from `char`
)
;

-- -----------------------------------------------
-- upgrade_20220830.sql
-- -----------------------------------------------

ALTER TABLE `char`
	ADD COLUMN `body_direction` tinyint unsigned NOT NULL default '0'
;

-- -----------------------------------------------
-- upgrade_20220831.sql
-- -----------------------------------------------

ALTER TABLE `char`
	ADD COLUMN `disable_call` tinyint unsigned NOT NULL default '0'
;
